[
    {
        "company": "Salesforce",
        "url": "https://www.salesforce.com/",
        "icon": "/assets/images/experienceIcons/salesforce.png",
        "title": "Software Engineer",
        "duration": "January 2025 - Present",
        "description": "",
        "overview": "#1 CRM",
        "overviewSource": "Salesforce's Website"
    },
    {
        "company": "Michigan State University x USDA",
        "url": "https://msu.edu/",
        "icon": "/assets/images/educationIcons/msu.png",
        "title": "Research Assistant | Programmer",
        "duration": "October 2022 - May 2024",
        "description": "<p><strong>About the project:</strong></p>\n<ul>\n<li>One of the notable projects that I worked on was a collaboration between <strong class=\"text-primary\">MSU</strong> and the <strong class=\"text-primary\">U.S. Department of Agriculture</strong> (USDA)&mdash;you might recognize their label on grocery store products. The project involved developing a <strong class=\"text-primary\">website</strong> that serves as a comprehensive directory for farmers' markets across the United States. This platform is designed to help small business owners/state associations promote their markets while also providing consumers with an easy way to discover and learn about local markets in their area.</li>\n</ul>\n<p><strong>What I did:</strong></p>\n<ul>\n<li>I built a completely new website from the ground up using <strong class=\"text-primary\">Vue</strong>, <strong class=\"text-primary\">TypeScript</strong>, <strong class=\"text-primary\">MySQL</strong>, and <strong class=\"text-primary\">PHP</strong>. Some of the standout features include:\n<ul>\n<li><strong class=\"text-primary\">Real-time notifications</strong>: USDA admins receive instant alerts to approve or reject publishing requests.</li>\n<li><strong class=\"text-primary\">Collaborative spreadsheet</strong>: An Excel-like interface allows members of the same association to work together in real-time to add new farmers' markets to the site.</li>\n<li><strong class=\"text-primary\">Excel parser</strong>: Easily converts farmers' market data from Excel/CSV files into the database.</li>\n<li><strong class=\"text-primary\">Customizable web pages</strong>: Each state association can personalize their pages, adjusting colors, text, and images before publishing their markets. For example, <a  class=\"text-primary\" href=\"https://www.usdalocalfooddirectories.com/bulkupdate/org/ohio\">Ohio State Extension</a> has its own tailored page.</li>\n<li><strong class=\"text-primary\">Interactive map and search engine</strong>: Users can filter markets based on various criteria.</li>\n<li><strong class=\"text-primary\">User behavior tracker</strong>: Monitors site performance by tracking visitor activity&mdash;who's visiting, how often, and more.</li>\n</ul>\n</li>\n<li>\n<p>The website is live and actively used by three state associations to regularly update their local farmers' markets. It&rsquo;s in the process of being rolled out to other states, and I&rsquo;m excited to see more markets appear on the platform soon!</p>\n</li>\n</ul>\n<p><strong>What I learned:</strong></p>\n<ul>\n<li>\n<div class=\"flex max-w-full flex-col flex-grow\">\n<div class=\"min-h-[20px] text-message flex w-full flex-col items-end gap-2 whitespace-pre-wrap break-words [.text-message+&amp;]:mt-5 overflow-x-auto\" dir=\"auto\" data-message-author-role=\"assistant\" data-message-id=\"ba93729e-2ca4-4100-a039-9338a5c13e75\">\n<div class=\"flex w-full flex-col gap-1 empty:hidden first:pt-[3px]\">\n<div class=\"markdown prose w-full break-words dark:prose-invert dark\">\n<p>This was my first experience tackling a project of this scale from the ground up, guiding it through every stage&mdash;from <strong class=\"text-primary\">development and testing</strong> to <strong class=\"text-primary\">deployment</strong>. I encountered numerous challenges along the way, but each one provided valuable lessons and opportunities for growth.</p>\n</div>\n</div>\n</div>\n</div>\n<div class=\"mt-1 flex gap-3 empty:hidden -ml-2\">\n<div class=\"items-center justify-start rounded-xl p-1 flex\">&nbsp;</div>\n</div>\n</li>\n</ul>",
        "overview": "The nation's premier land-grant university and one of the top research universities in the world.",
        "overviewSource": "MSU's Website"
    },
    {
        "company": "Salesforce - Data Cloud",
        "url": "https://www.salesforce.com/",
        "icon": "/assets/images/experienceIcons/salesforce-dc.png",
        "title": "Software Engineer Intern",
        "duration": "June 2024 - August 2024",
        "description": "<p><strong>About my team:</strong></p>\n<ul>\n<li>I joined the <strong class=\"text-primary\">Calculated Insights</strong> team at the Bellevue office, where our mission is to help customers unlock the true potential of their data stored in Data Cloud. While large amounts of data can be valuable, it often becomes overwhelming, leaving users struggling to extract meaningful insights. That&rsquo;s where our team steps in. We&rsquo;ve developed powerful tools that enable users to create custom calculations and metrics, transforming their raw data into actionable insights. We offer a Visual Builder with an intuitive user interface for non-technical users and a robust SQL language for those with technical expertise.</li>\n</ul>\n<div>\n<div dir=\"auto\" data-message-author-role=\"assistant\" data-message-id=\"20c751c5-9cc9-49a2-ace0-0809cbdfb012\">\n<p><strong>About my intern project:</strong></p>\n<ul>\n<li>In addition to structured data, our customers also store <strong class=\"text-primary\">unstructured data</strong>&mdash;such as text files and call transcripts&mdash;in Data Cloud. We wanted to empower users to derive valuable insights from this unstructured data as well. That&rsquo;s where my intern project came in. I integrated <strong class=\"text-primary\">vector embeddings</strong> into our custom SQL language, enabling users to perform <strong class=\"text-primary\">similarity searches</strong> within unstructured data. For example, users can now easily identify all reviews that mention a specific issue. Previously, this was nearly impossible, but with vector embeddings, we can now convert reviews into vectors and measure their similarity to a target vector, making this process efficient and effective.</li>\n</ul>\n</div>\n</div>\n<div>\n<div dir=\"auto\" data-message-author-role=\"assistant\" data-message-id=\"78aa6069-e797-4c42-bf0d-30335b780f9b\">\n<p><strong>What I did:</strong></p>\n<ul>\n<li>I introduced new syntax to our custom SQL language by implementing CROSS JOIN and ARRAY_AGG functions using <strong class=\"text-primary\">Java</strong>. Additionally, I developed a design document that outlined how to boost the performance of our integration by 50%, leveraging <strong class=\"text-primary\">FAISS</strong>&mdash;a library by Meta optimized for efficient vector distance calculations.</li>\n<li>Toward the end of my internship, I had some extra time, so I assisted my team with enhancements to the IN operator and completed several smaller tasks.</li>\n</ul>\n<p><strong>What I learned:</strong></p>\n<ul>\n<li>I had a great time diving into vector embeddings and understanding how similarity search operates. In addition, I gained valuable knowledge about <strong class=\"text-primary\">Apache Spark</strong> and <strong class=\"text-primary\">AWS</strong>, as our SQL interpreter is powered by <strong class=\"text-primary\">Spark SQL</strong> running on <strong class=\"text-primary\">EKS</strong>. I also deepened my understanding of <strong class=\"text-primary\">parsers</strong> and <strong class=\"text-primary\">abstract syntax trees (AST)</strong> since much of my work involved them. Along the way, I had the opportunity to connect with many talented individuals, which made the experience even more rewarding.</li>\n</ul>\n</div>\n</div>",
        "overview": "A data platform that unifies all of your company’s data on to Salesforce",
        "overviewSource": "Salesforce's Website"
    },
    {
        "company": "Salesforce - Marketing Cloud",
        "url": "https://www.salesforce.com/",
        "icon": "/assets/images/experienceIcons/salesforce-mk.png",
        "title": "Software Engineer Intern",
        "duration": "May 2023 - August 2023",
        "description": "<p><strong>About my team:</strong></p>\n<ul>\n<li>I joined the <strong class=\"text-primary\">Async</strong> team at the Atlanta office, where we developed a groundbreaking product: <strong class=\"text-primary\">Marketing Cloud Growth Edition</strong>. This innovative solution empowers small businesses with enterprise-level marketing automation capabilities. Marketing Cloud Growth seamlessly integrates marketing automation with sales, service, and commerce, all built on Salesforce&rsquo;s trusted Einstein 1 customer platform.</li>\n</ul>\n<div>\n<div dir=\"auto\" data-message-author-role=\"assistant\" data-message-id=\"20c751c5-9cc9-49a2-ace0-0809cbdfb012\">\n<p><strong>About my intern project:</strong></p>\n<ul>\n<li>During this internship, I was tasked with developing a new <strong class=\"text-primary\">QA page</strong> to streamline the process of enabling our team&rsquo;s service for existing development and testing tenants. Previously, developers and QA engineers had to manually initiate each task, a time-consuming and complex process, especially for those unfamiliar with it. The goal was to create a <strong class=\"text-primary\">web page</strong> with a user-friendly interface that allows our service to be activated with a single click. Additionally, the page provides error logs and displays the status of all related services.</li>\n</ul>\n</div>\n</div>\n<div>\n<div dir=\"auto\" data-message-author-role=\"assistant\" data-message-id=\"78aa6069-e797-4c42-bf0d-30335b780f9b\">\n<p><strong>What I did:</strong></p>\n<ul>\n<li>\n<p>My contributions included developing the QA page using <strong class=\"text-primary\">Java</strong>, <strong class=\"text-primary\">HTML</strong>, and <strong class=\"text-primary\">CSS</strong>. The most challenging aspect was automating the process by determining which APIs to call for enabling the service, retrieving necessary logs, and obtaining service status updates.</p>\n</li>\n<li>\n<p>After completing the QA page, I utilized my spare time to collaborate with the scrum team on bug fixes and feature enhancements. Notable tasks included updating the default language of the workspace from a hardcoded value to the organization's language, which improved accessibility and helped clean up the codebase.</p>\n</li>\n</ul>\n<p><strong>What I learned:</strong></p>\n<ul>\n<li>This was my first internship at a large company, and it provided invaluable insights into software development processes and agile methodology. I joined the team just as we were preparing for our first product rollout, which gave me hands-on experience with large-scale projects. I also significantly enhanced my skills in code tracing and debugging, which proved crucial in navigating the challenges of complex systems.</li>\n</ul>\n</div>\n</div>",
        "overview": "A digital marketing platform allows businesses to create, automate, and personalize marketing campaigns.",
        "overviewSource": "Salesforce's Website"
    },
    {
        "company": "Holistics Data",
        "url": "https://www.holistics.io/",
        "icon": "/assets/images/experienceIcons/holistics.png",
        "skills": "Vue.js, TypeScript, HTML/CSS",
        "title": "Software Engineer Intern",
        "duration": "May 2022 - September 2022",
        "description": "<p><strong>About the project:</strong></p>\n<ul>\n<li><strong class=\"text-primary\">AML</strong> is a <strong class=\"text-primary\">functional programming language</strong> developed by Holistics Data, specifically used for analytics. During this internship, I worked mostly on this project along with the <strong class=\"text-primary\">AML playground</strong> and an internal <strong class=\"text-primary\">vscode extension</strong> to connect docs and codebase.</li>\n</ul>\n<p><strong>What I did:</strong></p>\n<ul>\n<li>\n<p>I implemented <strong class=\"text-primary\">if-else expressions</strong> and <strong class=\"text-primary\">string interpolation</strong> for AML. The if-else feature allows users to write more complex code, while string interpolation simplifies the insertion of variables into strings, using syntax similar to TypeScript.</p>\n</li>\n<li>\n<p>For the AML playground, I developed an interactive <strong class=\"text-primary\">AST visualizer</strong>, which greatly benefited the development team by providing a clear view of the AST tree for troubleshooting lexer and parser issues. Additionally, I introduced a <strong class=\"text-primary\">file tree feature</strong>, enabling users to work on multiple files simultaneously. The code is saved locally on the user's device and can be easily shared with others via a simple URL.</p>\n</li>\n<li>The <strong class=\"text-primary\">VSCode extension</strong> was developed during an internal hackathon to address an existing challenge: users struggled to locate relevant documentation while working on various parts of the codebase. To solve this, we designed a solution that integrates our codebase with <strong class=\"text-primary\">Notion</strong> and <strong class=\"text-primary\">Slack</strong>, where our documentation is stored, using a <strong class=\"text-primary\">tag-based system</strong>. Each piece of code is assigned a tag that links directly to the corresponding documentation. Additionally, we created a <strong class=\"text-primary\">graph visualizer</strong> where each node represents a knowledge piece (either code or documentation). Nodes are connected if they share the same tag, providing a clear, visual representation of how different elements of our codebase and documentation are related.</li>\n</ul>\n<p><strong>What I learned:</strong></p>\n<ul>\n<li>\n<p>I had the opportunity to explore <strong class=\"text-primary\">compilers</strong> and was introduced to <strong class=\"text-primary\">Vue</strong>, a framework that I quickly grew to love. During this internship, I focused extensively on UI development to support the AML playground, gaining significant insights along the way.</p>\n</li>\n<li>\n<p>This experience had a lasting impact on my career. As you'll notice in my later projects/experience, I continued to use <strong class=\"text-primary\">Vue</strong> and <strong class=\"text-primary\">TypeScript</strong> for frontend development. My interest in compilers also deepened. Spoiler alert: I had another chance to explore this topic during an internship at Salesforce, where I found it fascinating to see how different teams handle the underlying logic of programming languages!</p>\n</li>\n</ul>",
        "overview": "A modern BI platform that aims to enable self-service data access for entire organization.",
        "overviewSource": "Holistics Data's Website"
    },
    {
        "company": "Open Energy Dashboard",
        "url": "https://openenergydashboard.github.io/",
        "icon": "/assets/images/experienceIcons/oed.png",
        "skills": "React, Redux, TypeScript, JavaScript, Postgres",
        "title": "Software Engineer Intern",
        "duration": "October 2021 - Dec 2022",
        "description": "<p><strong>About the project:</strong></p>\n<ul>\n<li>The <strong class=\"text-primary\">Open Energy Dashboard (OED)</strong> is an <strong class=\"text-primary\">open-source</strong> project spearheaded by a professor at Beloit College. Its goal is to offer a free and accessible platform for <strong class=\"text-primary\">monitoring energy usage</strong>. OED collects data directly from meters, which is then used to populate and visualize energy consumption trends on the website, making it easier for users to track and manage their energy use effectively.</li>\n<li>I joined the OED team remotely in October 2021, just as we were preparing to launch the first production version, <strong class=\"text-primary\">v1</strong>. My primary responsibility was to implement support for multiple <strong class=\"text-primary\">data units</strong> on the website and enable seamless unit conversion. For instance, users can view temperature data in Celsius, Fahrenheit, or Kelvin, depending on their preference.</li>\n<li>More information: <strong class=\"text-primary\"><a href=\"https://github.com/OpenEnergyDashboard/OED\">OED Github</a></strong></li>\n</ul>\n<p><strong>What I did:</strong></p>\n<ul>\n<li>\n<p>Supporting unit conversions required changes across the entire codebase, from the <strong class=\"text-primary\">database</strong> (where we needed to store the unit for each dataset) to the <strong class=\"text-primary\">backend</strong> (developing new <strong class=\"text-primary\">APIs</strong> to handle units) and the <strong class=\"text-primary\">frontend</strong> (creating a UI for users to interact with different units). It was an exciting challenge to work across these various areas of the codebase, especially during my first internship when I was still exploring my interests in computer science.</p>\n</li>\n<li>\n<p>One of the most fascinating tasks was optimizing the unit conversion process. For example, converting Celsius to Fahrenheit. We represented units as nodes in a graph, with edges between nodes representing direct conversions. For instance, the edge between Celsius and Fahrenheit had a value of * 1.8 + 32. Using this graph structure, we applied <strong class=\"text-primary\">Dijkstra&rsquo;s</strong> <strong class=\"text-primary\">algorithm</strong> to find the shortest path between two nodes, ensuring the most efficient conversion from one unit to another.</p>\n</li>\n</ul>\n<p><strong>What I learned:</strong></p>\n<ul>\n<li>I gained significant experience with <strong class=\"text-primary\">Git</strong>, <strong class=\"text-primary\">React</strong>, <strong class=\"text-primary\">Redux</strong>, <strong class=\"text-primary\">JavaScript</strong>, <strong class=\"text-primary\">TypeScript,</strong> and <strong class=\"text-primary\">PostgreSQL</strong>. More importantly, I developed strong collaboration and communication skills, which are difficult to hone through personal projects alone. I also deepened my understanding of the software development pipeline, including the roles of <strong class=\"text-primary\">unit tests</strong>, <strong class=\"text-primary\">continuous integration (CI)</strong>, and other key processes. Working on an open-source project gave me valuable insights into different license types, reinforcing the importance of checking a library&rsquo;s license before integrating it into a project.</li>\n</ul>",
        "overview": "A free, open source project that provides a web-based application to display energy information in a web browser.",
        "overviewSource": "OED's Website"
    }
]